---
kind: method
id: M:Autodesk.Revit.UI.DockablePaneProviderData.#ctor
source: html/f8085222-4fcd-e58b-52ee-1f6d3ca9706d.htm
---
# Autodesk.Revit.UI.DockablePaneProviderData.#ctor Method

Initializes a new instance of the DockablePaneProviderData class

## Syntax (C#)
```csharp
public DockablePaneProviderData()
```